#ifndef __SERVICE_USER_H__
#define __SERVICE_USER_H__
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <conio.h> 
#include "mapper_user.h"
#include "struct.h"

char *column_name[] = {"用户名","姓名","密码","权限","性别","部门","学历","员工号","电话","在职状态"};
char *role[] = {"普通用户","部门经理","管理员"};
char *sex[] = {"女","男"}; 
char *dprt[] = {"技术部","开发部","产品部"};
char *education[] = {"小学","初级中学","高级中学","中专","职校","中技","专科","本科","硕士研究生","博士研究生"};
char *status[] = {"离职","在职"}; 

/*
===========================================================================================================================										
														
													管理员操作
														
===========================================================================================================================
*/
// 添加员工
bool admin_save_user(USERS *p_users);
// 删除员工
bool admin_delete_user(USERS *p_users);
// 修改员工
bool admin_udpate_user(USERS *p_users);
// 查找员工
bool admin_select_user(USERS users);
// 员工信息总览 
bool staff_info(USERS users);
//================================================管理员操作结束=========================================================



/*
===========================================================================================================================										
														
													部门经理操作
														
===========================================================================================================================
*/
//================================================部门经理操作结束=========================================================




/*
===========================================================================================================================										
														
													一般员工操作
														
===========================================================================================================================
*/
// 员工入职 
bool staff_induction(sqlite3 *db,DATABASE *datainfo,USER *p_user);
// 修改个人信息 
bool update_info(sqlite3 *db,DATABASE *datainfo,USER *p_user);
//================================================一般员工操作结束=========================================================

/*
===========================================================================================================================										
														
														公共函数 
														
===========================================================================================================================
*/
// 登录 
bool login(sqlite3 *db,DATABASE *datainfo,USER *p_user); 
// 打印当前用户信息 
void printUserInfo(DATABASE *datainfo);
// 当前用户的信息 
void curr_user_info(char **data,USER *p_user);
// 修改用户名 
bool update_username(sqlite3 *db,DATABASE *datainfo,USER *p_user); 
// 修改姓名 
bool update_name(sqlite3 *db,DATABASE *datainfo,USER *p_user); 
// 修改密码 
bool update_password(sqlite3 *db,DATABASE *datainfo,USER *p_user);
// 修改学历 
bool update_edu(sqlite3 *db,DATABASE *datainfo,USER *p_user);  
// 询问是否修改信息
int alert(char *info); 
#endif 
