#include "service_dprt.h"


//================================================管理员操作=========================================================
// 添加部门 
bool admin_save_dapart(DEPARTMENTS *p_dprts)
{
	system("cls");
	printf("\t\t添加部门 \n"); 
	return true; 
}
// 删除部门 
bool admin_delete_dapart(DEPARTMENTS *p_dprts)
{
	system("cls");
	printf("\t\t删除部门\n"); 
	return true; 
}
// 修改部门 
bool admin_udpate_dapart(DEPARTMENTS *p_dprts)
{
	system("cls");
	printf("\t\t修改部门\n"); 
	return true; 
}
// 查找部门 
bool admin_select_dapart(DEPARTMENTS dprts){
	system("cls");
	printf("\t\t查找部门\n"); 
	return true; 
}
// 部门信息总览 
bool dapart_info(DEPARTMENTS dprts)
{
	system("cls");
	printf("\t\t部门信息总览 \n"); 
	return true; 
}
//================================================管理员操作结束=========================================================

//================================================部门经理操作=========================================================


//================================================部门经理操作结束=========================================================


//================================================一般员工操作=========================================================

//================================================一般员工操作结束=========================================================
