#include "service_count.h"


//====================================按性别统计员工 
bool count_by_sex(USERS users,USER user)
{
	system("cls");
	printf("按性别统计员工");
	return true; 
}
//====================================按部门统计员工 
bool count_by_dprt(USERS users,USER user)
{
	system("cls");
	printf("按部门统计员工");
	return true; 
}
//====================================按学历统计员工 
bool count_by_edu(USERS users,USER user)
{
	system("cls");
	printf("按学历统计员工");
	return true; 
}
//================================================管理员操作=========================================================

//================================================管理员操作结束=========================================================


//================================================部门经理操作=========================================================
//================================================部门经理操作结束=========================================================


