#ifndef __SERVICE_DPRT_H__ 
#define __SERVICE_DPRT_H__ 
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "mapper_dprt.h"
#include "struct.h"


//================================================管理员操作=========================================================
// 添加部门 
bool admin_save_dapart(DEPARTMENTS *p_dprts);
// 删除部门 
bool admin_delete_dapart(DEPARTMENTS *p_dprts);
// 修改部门 
bool admin_udpate_dapart(DEPARTMENTS *p_dprts);
// 查找部门 
bool admin_select_dapart(DEPARTMENTS dprts);
// 部门信息总览 
bool dapart_info(DEPARTMENTS dprts);
//================================================管理员操作结束=========================================================


//================================================部门经理操作=========================================================
//================================================部门经理操作结束=========================================================

//================================================一般员工操作=========================================================
//================================================一般员工操作结束=========================================================



#endif
